---
kind: property
id: P:Autodesk.Revit.DB.InSessionViewSheetSet.ViewOrganizationId
source: html/1b0df884-d8d4-e55f-f940-6c96fbea125b.htm
---
# Autodesk.Revit.DB.InSessionViewSheetSet.ViewOrganizationId Property

ElementId to the BrowserOrganization for non-sheet views.

## Syntax (C#)
```csharp
public virtual ElementId ViewOrganizationId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when the ElementId does not reference to BrowserOrganization , or the target type of BrowserOrganization is incompatible.